<a href="https://colab.research.google.com/github/apeksha309/FDS_LabWork/blob/main/Assignment1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [6]:
empid=['E101','E102','E103','E104']
fname=['Shweta','Manisha','Madhu','Anita']
lname=['Subnis','Perdesi','Mali','Rai']
designation=['ProjectEngineer','Tester','SrSoftwareEngineer','WebDeveloper']
basic_salary=[40000,50000,60000,70000]
emplist=zip(empid,fname,lname,designation,basic_salary)
df=pd.DataFrame(data=emplist,columns=['EmpId','FName','LName','Designation','Basic Salary'])
df.to_csv('employeedetails.csv',index=False,header=False)
df

  EmpId    FName    LName         Designation  Basic Salary
0  E101   Shweta   Subnis     ProjectEngineer         40000
1  E102  Manisha  Perdesi              Tester         50000
2  E103    Madhu     Mali  SrSoftwareEngineer         60000
3  E104    Anita      Rai        WebDeveloper         70000

In [8]:
pip install xlsxwriter

Collecting xlsxwriter
  Downloading https://files.pythonhosted.org/packages/6b/41/bf1aae04932d1eaffee1fc5f8b38ca47bbbf07d765129539bc4bcce1ce0c/XlsxWriter-1.3.7-py2.py3-none-any.whl (144kB)
     |████████████████████████████████| 153kB 5.2MB/s
Installing collected packages: xlsxwriter
Successfully installed xlsxwriter-1.3.7

In [9]:
empid=['E101','E102','E103','E104']
fname=['Shweta','Manisha','Madhu','Anita']
lname=['Subnis','Perdesi','Mali','Rai']
designation=['ProjectEngineer','Tester','SrSoftwareEngineer','WebDeveloper']
basic_salary=[40000,50000,60000,70000]
emplist=zip(empid,fname,lname,designation,basic_salary)
df=pd.DataFrame(data=emplist,columns=['EmpId','FName','LName','Designation','Basic Salary'])
writer=pd.ExcelWriter('dataframe.xlsx',engine='xlsxwriter')
df.to_excel(writer,sheet_name='Sheet1')
writer.save()
df.head()

  EmpId    FName    LName         Designation  Basic Salary
0  E101   Shweta   Subnis     ProjectEngineer         40000
1  E102  Manisha  Perdesi              Tester         50000
2  E103    Madhu     Mali  SrSoftwareEngineer         60000
3  E104    Anita      Rai        WebDeveloper         70000

In [12]:
import os
import sqlite3 as lite
mpid=['E101','E102','E103','E104']
fname=['Shweta','Manisha','Madhu','Anita']
lname=['Subnis','Perdesi','Mali','Rai']
designation=['ProjectEngineer','Tester','SrSoftwareEngineer','WebDeveloper']
basic_salary=[40000,50000,60000,70000]
emplist=zip(empid,fname,lname,designation,basic_salary)
df=pd.DataFrame(data=emplist,columns=['EmpId','FName','LName','Designation','Basic Salary'])
db_employee = r'mydb.db'
con = lite.connect(db_employee)
df.to_sql('employees',
con,
schema=None,
if_exists='replace',
index=True,
index_label=None,
chunksize=None,
dtype=None)
con.close()

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [15]:
import pandas as pd
from sqlalchemy import create_engine
db_file = r'mydb.db'
engine = create_engine(r"sqlite:///{}" .format(db_file))
sql = 'SELECT * from employees'
'where Grades in (76,77,78)'
df = pd.read_sql(sql, engine)
df

   index EmpId    FName    LName         Designation  Basic Salary
0      0  E101   Shweta   Subnis     ProjectEngineer         40000
1      1  E102  Manisha  Perdesi              Tester         50000
2      2  E103    Madhu     Mali  SrSoftwareEngineer         60000
3      3  E104    Anita      Rai        WebDeveloper         70000